InformationRegisters/СвязанныеУпрКО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>СвязанныеУпрКО</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>РКО</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УпрРасходныйКассовыйОрдер</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПКО</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УпрПриходныйКассовыйОрдер</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыОперацийПКО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыОперацийПКО</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОплатаПокупателя</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриходДенежныхСредствРозничнаяВыручка</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратДенежныхСредствПодотчетником</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратДенежныхСредствПоставщиком</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолучениеНаличныхДенежныхСредствВБанке</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыПоКредитамИЗаймамСКонтрагентами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриходДенежныхСредствПрочее</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеРасчетыСКонтрагентами</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/ДО_Привелигированный/Ext/Module.bsl
Функция ЗаписатьНаборЗаписейПользователиУправленческихПодсистем(МассивПользователей) Экспорт 
	Набор = РегистрыСведений.ПользователиУправленческихПодсистем.СоздатьНаборЗаписей();
	Набор.Прочитать();
	Набор.Очистить();
	Для каждого ел Из МассивПользователей Цикл
		НовЗ = Набор.Добавить();
		ЗаполнитьЗначенияСвойств(новЗ,ел);
	КонецЦикла; 
	
	Набор.Записать();
	
	Возврат Истина
КонецФункции	

Функция СформиороватьПКО_из_РКО(Мас,Отказ)Экспорт 
	Для Каждого ТекСсылка из Мас Цикл 
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	СвязанныеУпрКО.ПКО,
			|	СвязанныеУпрКО.ПКО.Проведен КАК ПКО_Проведен
			|ИЗ
			|	РегистрСведений.СвязанныеУпрКО КАК СвязанныеУпрКО
			|ГДЕ
			|	СвязанныеУпрКО.РКО = &РКО";
		
		Запрос.УстановитьПараметр("РКО", ТекСсылка);
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Если  ВыборкаДетальныеЗаписи.Следующий() Тогда 
			Если ВыборкаДетальныеЗаписи.ПКО_Проведен Тогда 
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Документ, "+ ВыборкаДетальныеЗаписи.ПКО+" подтверждающий получение, уже проведен!",,,,Отказ);
				Продолжить;
			иначе	
				ДокПКО = ВыборкаДетальныеЗаписи.ПКО.ПолучитьОбъект();
			КонецЕсли;	
		иначе	
			ДокПКО = Документы.УпрПриходныйКассовыйОрдер.СоздатьДокумент();
			ДокПКО.Дата = ТекущаяДата();
			
			  //Dasha 09.05.2022 16:04 +++
			Если ТекСсылка.Дата < Дата("20220501000000") Тогда
				ДокПКО.Дата = ТекСсылка.Дата;
				//ДокПКО.Номер = ТекСсылка.Номер;
				ДокПКО.УстановитьНовыйНомер();
			КонецЕсли;
			//Dasha 09.05.2022 16:04 ---
			
		КонецЕсли;


		ДокПКО.Касса = ТекСсылка.КассаПолучатель;
		ДокПКО.Организация = ДокПКО.Касса.Владелец;
		ДокПКО.ВидОперации = Перечисления.ВидыОперацийПКО.ПриходДенежныхСредствПрочее;
		ДокПКО.КассаОтправитель = ТекСсылка.Касса;
		ДокПКО.СуммаДокумента = ТекСсылка.СуммаДокумента;
		ДокПКО.ОтражатьВУправленческомУчете = Истина;
		ДокПКО.ОтражатьВБухгалтерскомУчете = Ложь;
		ДокПКО.ВалютаДокумента = ТекСсылка.ВалютаДокумента;
		
		Если ТекСсылка.ВалютаДокумента = Константы.ВалютаРегламентированногоУчета.Получить() Тогда 
			ДокПКО.СчетКасса = ПланыСчетов.Хозрасчетный.КассаВНациональнойВалюте;
		иначе
			ДокПКО.СчетКасса = ПланыСчетов.Хозрасчетный.КассаВИностраннойВалюте;
		КонецЕсли;	
		
		ДокПКО.РасшифровкаПлатежа.Очистить();
		Если ТекСсылка.РасшифровкаПлатежа.Количество() Тогда 
			НовСтр = ДокПКО.РасшифровкаПлатежа.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр,ТекСсылка.РасшифровкаПлатежа[0]);
		КонецЕсли;	
		
		Если ДокПКО.ЭтоНовый() Тогда 
			ДокПКО.Записать(РежимЗаписиДокумента.Запись);
			
			Запись = РегистрыСведений.СвязанныеУпрКО.СоздатьМенеджерЗаписи();
			Запись.РКО = ТекСсылка;
			Запись.ПКО = ДокПКО.Ссылка;
			Запись.Записать();
			
		иначе
			ДокПКО.Записать(РежимЗаписиДокумента.Запись);
		КонецЕсли;	
	КонецЦикла;	
	Возврат Истина;
КонецФункции	


 
// Формирует номер расходного оредера в пределах организации
//
Процедура  УстановитьНомерОрдера(ДокОб,ЕстьАналитикаПоОбособленнымПодразделениям)Экспорт 
	
	Если глЗначениеПеременной("ИспользоватьУправляемыеБлокировки") Тогда
		СтруктураПараметровБлокировка = Новый Структура("ТипТаблицы, ИмяТаблицы", "Справочник", "ОбособленныеПодразделенияОрганизаций");
		
		ЗначенияБлокировки = Новый Структура;
		ЗначенияБлокировки.Вставить("Ссылка", ДокОб.Касса.ОбособленноеПодразделение);
		ОбщегоНазначения.УстановитьУправляемуюБлокировку(СтруктураПараметровБлокировка, ЗначенияБлокировки, , Ложь, "");
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачалаГода", НачалоГода(ДокОб.Дата));
	Запрос.УстановитьПараметр("ДатаКонцаГода", КонецГода(ДокОб.Дата));
	Запрос.УстановитьПараметр("Организация", ДокОб.Организация);
	Запрос.УстановитьПараметр("СчетКасса", ДокОб.СчетКасса);
	Запрос.УстановитьПараметр("ВалютаДокумента", ДокОб.ВалютаДокумента);
	Запрос.УстановитьПараметр("ОбособленноеПодразделение", ДокОб.Касса.ОбособленноеПодразделение);
	Запрос.УстановитьПараметр("Ссылка", ДокОб.Ссылка);

	ТекстЗапроса =
	"ВЫБРАТЬ
	|	НомерОрдера КАК НомерОрдера
	|ИЗ
	|	Документ.УпрРасходныйКассовыйОрдер КАК УпрРасходныйКассовыйОрдер
	|
	|ГДЕ
	|	УпрРасходныйКассовыйОрдер.Организация = &Организация
	|	//самого себя не учитываем
	|	И УпрРасходныйКассовыйОрдер.Ссылка <> &Ссылка
	|	И УпрРасходныйКассовыйОрдер.СчетКасса = &СчетКасса	
	|	И УпрРасходныйКассовыйОрдер.ВалютаДокумента = &ВалютаДокумента";
	Если ЕстьАналитикаПоОбособленнымПодразделениям Тогда
		ТекстЗапроса = ТекстЗапроса + "
	|	И УпрРасходныйКассовыйОрдер.Касса.ОбособленноеПодразделение = &ОбособленноеПодразделение";
	КонецЕсли;
	ТекстЗапроса = ТекстЗапроса + "
	|	И УпрРасходныйКассовыйОрдер.Дата >= &ДатаНачалаГода
	|	И УпрРасходныйКассовыйОрдер.Дата <= &ДатаКонцаГода";

	Запрос.Текст = ТекстЗапроса;
	
	СписокОрдеров = Запрос.Выполнить().Выбрать();
	
	ТаблицаЗначений = Новый ТаблицаЗначений;
	 
	ТаблицаЗначений.Колонки.Добавить("Номер"); 
	ТаблицаЗначений.Колонки.Добавить("Длина"); 

	Пока СписокОрдеров.Следующий() Цикл
		НоваяСтрока = ТаблицаЗначений.Добавить(); 
		НоваяСтрока.Номер = СписокОрдеров.НомерОрдера; 
		НоваяСтрока.Длина = СтрДлина(СписокОрдеров.НомерОрдера); 
	КонецЦикла;
	
	ТаблицаЗначений.Сортировать("Длина Убыв, Номер Убыв");
	
	НомерОрдера = 0;
	
	Если ТаблицаЗначений.Количество() > 0 Тогда
		Попытка
			ДокОб.НомерОрдера = Формат(Число(ТаблицаЗначений[0].Номер) + 1, "ЧГ=0");
		Исключение
			ДокОб.НомерОрдера = 1;	
		КонецПопытки;
	Иначе
		ДокОб.НомерОрдера = 1;
	КонецЕсли;
	
	
КонецПроцедуры
